---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures
source: html/e66c9b7b-8a99-e828-ab11-4110f2a44868.htm
---
# BuiltInFailures.StairRampFailures Properties

The actual riser height for one or more stairs violates the maximum set in the type.